app/controllers/launches_controller.rb

INSERT INTO "launches" ("rocket_id", "site_name", "customer", "periapsis_km", "launch_time", "cost_per_launch", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    response = SpaceXData::V3::ListRockets.new.call
    result = LaunchHandler.new(launch_params(params), response.body).call

    error_message = result[:error]
    return render json: { error: error_message }, status: :unprocessable_entity if error_message

    launch_attributes = result[:attributes]
    return render json: launch_attributes, status: :created if Launch.create(launch_attributes)